[
  {
    "title": "Client Overview",
    "slug": "client-overview",
    "items": [
      {
        "title": "What is EASWORKS?",
        "slug": "what-is-easworks"
      },
      {
        "title": "How does EASWORKS work?",
        "slug": "how-does-easworks-work"
      },
      {
        "title": "How is EASWORKS different from other platforms?",
        "slug": "how-is-easworks-different-from-other-platforms"
      },
      {
        "title": "What is the definition of EAS Talent as referred to companies by EASWORKS?",
        "slug": "what-is-the-definition-of-eas-talent"
      },
      {
        "title": "What types of projects can be undertaken by hiring EASWORKS?",
        "slug": "what-types-of-projects-can-be-undertaken"
      },
      {
        "title": "What is the role of an Enterprise Success Manager (ESM) with companies?",
        "slug": "what-is-the-role-of-an-enterprise-success-manager"
      },
      {
        "title": "Is there a cost associated with being matched with or interviewing candidates on EASWORKS?",
        "slug": "is-there-a-cost-associated-with-matching-on-easworks"
      },
      {
        "title": "What is the typical timeframe for the hiring process at EASWORKS?",
        "slug": "what-is-the-typical-timeframe-for-hiring-on-easworks"
      },
      {
        "title": "Is there a fee to be matched with or interview candidates on EASWORKS?",
        "slug": "is-there-a-fee-to-be-matched-or-interviewed-on-easworks"
      },
      {
        "title": "What engagement options does EASWORKS offer to meet clients enterprise application needs",
        "slug": "what-engagement-options-does-easworks-offer"
      },
      {
        "title": "Is there a minimum contract duration?",
        "slug": "is-there-a-minimum-contract-duration"
      },
      {
        "title": "Is it possible to hire a full-time worker from EASWORKS and integrate them into our company?",
        "slug": "is-it-possible-to-hire-a-full-time-worker-from-easworks"
      },
      {
        "title": "What are the payment terms and conditions on EASWORKS?",
        "slug": "what-are-the-payment-terms-and-conditions"
      },
      {
        "title": "How does the Work Skill Assessment (WSA) performed on talents help clients in their project engagements?",
        "slug": "how-does-the-work-skill-assessment-help-clients"
      }
    ]
  },
  {
    "title": "Getting Started With EASWORKS",
    "slug": "getting-started-with-easworks",
    "items": [
      {
        "title": "How can I get started with EASWORKS as an employer?",
        "slug": "how-can-i-get-started-with-easworks-as-an-employer"
      },
      {
        "title": "How can I initiate a project with EASWORKS?",
        "slug": "how-can-i-initiate-a-project-with-easworks"
      },
      {
        "title": "How can I view candidates after registration?",
        "slug": "how-can-i-view-candidates-after-registration"
      },
      {
        "title": "How can I interact with candidates on EASWORKS?",
        "slug": "how-can-i-interact-with-candidates-on-easworks"
      },
      {
        "title": "How soon can EASWORKS developers become part of my team?",
        "slug": "how-soon-can-easworks-developers-become-part-of-my-team"
      },
      {
        "title": "If there is currently no available talent to meet the requirements of my work request, how long should I anticipate waiting for the right talent?",
        "slug": "if-there-is-currently-no-available-talent-to-meet-the-requirements-of-my-work-request-how-long-should-i-anticipate-waiting-for-the-right-talent"
      }
    ]
  },
  {
    "title": "Testing & Screening",
    "slug": "testing-and-screening",
    "items": [
      {
        "title": "Do the developers at EASWORKS possess fluency in English?",
        "slug": "do-the-developers-at-easworks-possess-fluency-in-english"
      },
      {
        "title": "How does your screening process work?",
        "slug": "how-does-your-screening-process-work"
      },
      {
        "title": "How does your EAS talent vetting process work?",
        "slug": "how-does-your-eas-talent-vetting-process-work"
      }
    ]
  },
  {
    "title": "Working With Global Talent",
    "slug": "",
    "link": "",
    "items": [
      {
        "title": "What are the various engagement models available for hiring EAS talent?",
        "slug": "",
        "content": [
          "At EASWORKS, we understand that every project and organization is unique. We offer tailored engagement models to cater to your specific project needs, situation, and company goals. ",
          "Our aim is to ensure your success in enterprise application projects by leveraging our core expertise. We work closely with you to create a customized team augmentation strategy that aligns with your requirements and maximizes project outcomes."
        ]
      },
      {
        "title": "What is the geographical distribution and time zone of EASWORKS developers?",
        "slug": "",
        "content": [
          "EASWORKS boasts a global network of talented freelancers located across different geographies and time zones. ",
          "We commonly collaborate with top enterprise application software (EAS) developers from regions such as Latin America, Asia, Eastern Europe, and the United States. ",
          "This approach allows us to offer competitive rates while ensuring effective communication and collaboration between teams and clients within the same time zones."
        ]
      },
      {
        "title": "Where do EASWORKS experts primarily work?",
        "slug": "",
        "content": [
          "The majority of EASWORKS experts work remotely from their home, office, or co-working spaces.",
          "However, if there is a requirement for enterprise talents to work on your premises, we can coordinate and make necessary arrangements based on mutual agreement between all parties involved."
        ]
      },
      {
        "title": "How can I track and monitor the progress of my EAS project?",
        "slug": "",
        "content": [
          "For staff augmentation projects, EAS Talent will provide daily updates and status reports through EASWORKS online tools, which you will have access to. ",
          "For fully managed projects, weekly/monthly timesheet submissions and project status reports are utilized to keep you informed about the progress of the project."
        ]
      },
      {
        "title": "How does EASWORKS facilitate and oversee project collaboration?",
        "slug": "",
        "content": [
          "When you start working with EASWORKS, we will invite you to join our Slack workspace for project collaboration.",
          " We set up two main channels for communication: \"Project Mgt\" and \"GO LIVE\" (Production).",
          "•\tThe \"Project Mgt\" channel includes you, your Enterprise Success Manager (ESM), and EASWORKS senior staff. This channel is used for any changes or questions regarding your current engagement.",
          "•\tThe \"GO LIVE\" channel includes everyone from the \"Prj Mgt\" channel, as well as your hired company and the scrum team if needed. This channel is used for regular project updates and discussions.",
          "Participating in these Slack channels is optional, and if you already have your own Slack workspace, you can use that instead."
        ]
      },
      {
        "title": "Can I make changes to my current engagement with EASWORKS?",
        "slug": "",
        "content": [
          "Absolutely! We understand that enterprise application project needs can evolve over time. You have the flexibility to make adjustments to your EASWORKS engagement. Here are some of the changes you can make:",
          "•\tIncrease or decrease the monthly hours allocated to your project.",
          "•\tTransition between different engagement types based on your evolving requirements.",
          "•\tAdd additional freelancers to your EAS project as needed.",
          "To request any changes, simply reach out to your dedicated Enterprise Success Manager (ESM), and they will guide you through the process. Were here to ensure that your engagement with EASWORKS aligns with your changing needs."
        ]
      },
      {
        "title": "Is it possible to have EASWORKS experts work on-site as needed?",
        "slug": "",
        "content": [
          "While it is not a common occurrence, we understand that certain projects may require on-site presence. If this is the case, we are open to coordinating the relocation of our EAS Talent or a team to your location for a specific period of time.",
          "Our priority is to ensure that your project receives the necessary support and expertise to achieve success."
        ]
      },
      {
        "title": "What if Im not satisfied with the EASWORKS services?",
        "slug": "",
        "content": [
          "At EASWORKS, we prioritize customer satisfaction and take measures to address any concerns:",
          "•\tRigorous Screening: We carefully select top enterprise application talent through a thorough screening process.",
          "•\tTrial Period: We offer a trial period for long-term projects to ensure a good fit with the assigned developer.",
          "•\tFair Resolution: If customers are unsatisfied with their Talent, our Enterprise Success Team seeks a fair resolution, including the possibility of replacing the EAS Talent at no additional cost.",
          "Our ultimate aim is to ensure that you have a positive and satisfactory experience throughout your engagement with EASWORKS."
        ]
      },
      {
        "title": "What if my EAS Talent is unavailable during their scheduled workdays or times?",
        "slug": "",
        "content": [
          "At EASWORKS, we prioritize dependability and understand the importance of meeting enterprise project goals. While we take steps to ensure availability and reliability of our talent, if an unforeseen circumstance arises where your Talent is unavailable, we will promptly match you with a new Talent and credit you for the time lost.",
          "Our aim is to ensure uninterrupted progress and seamless collaboration on your EAS project."
        ]
      }
    ]
  },
  {
    "title": "Intellectual Property",
    "slug": "",
    "link": "",
    "items": [
      {
        "title": "Who holds the legal rights to the work produced by an EASWORKS talent? ",
        "slug": "",
        "content": [
          "The client retains exclusive ownership of the work created by an EASWORKS talent. ",
          "EASWORKS focus is on connecting clients with exceptional Enterprise Application experts, and our contracts specify that all work produced by the expert is considered \"work for hire\" and belongs to the client, not EASWORKS or the expert."
        ]
      },
      {
        "title": "How can I protect my intellectual property (IP) with EASWORKS? ",
        "slug": "",
        "content": [
          "Safeguarding your intellectual property is a priority for us. EASWORKS is willing to establish a mutual non-disclosure agreement (NDA) to ensure confidentiality before delving into project specifics. ",
          "We have stringent confidentiality agreements with our contractors, and its important to note that IP is never owned by any freelancer who is hired either part time or full time.",
          "Additionally, if desired, you can opt to sign additional agreements such as a Master Services Agreement (MSA) with the developer for added protection."
        ]
      },
      {
        "title": "How does EASWORKS ensure the protection of our intellectual property (IP)? ",
        "slug": "",
        "content": [
          "EASWORKS prioritizes the protection of your intellectual property. Through our contract agreements, we secure exclusive ownership of the work created by the EASWORKS talent assigned to your project. ",
          "This ensures that you have full control and rights over intellectual property. Our client agreement follows the principle of \"work for hire,\" granting you the necessary legal rights.",
          " This approach has been successful in safeguarding our clients IP over the years and has provided them with peace of mind. If you have specific requirements regarding IP ownership, we are open to discussing and accommodating them to meet your needs."
        ]
      }
    ]
  },
  {
    "title": "Pricing And Payments",
    "slug": "",
    "link": "",
    "items": [
      {
        "title": "What are the pricing details for hiring a developer through EASWORKS?",
        "slug": "",
        "content": [
          "At EASWORKS, the cost of hiring a developer varies depending on several factors. While we work with remote developers located worldwide, our common talent pool comes from Latin America, South Asia, and Eastern Europe. This allows us to offer competitive rates while ensuring collaboration in overlapping time zones.",
          "The rates for developers typically range between $40-$110 USD per hour. However, its important to note that these rates can vary based on factors such as enterprise application skills, technologies, experience, and geographic location.",
          "When hiring through EASWORKS, there are no hidden or extra fees. You only pay for the hours worked by the candidates you select, as per the agreed terms and conditions outlined in the contract."
        ]
      },
      {
        "title": "What is the payment process for EASWORKS services?",
        "slug": "",
        "content": [
          "The payment process for EASWORKS services depends on the type of engagement you have with us. Here is an overview:",
          "1.\tBilling Cycle: For most engagements, you will be billed at the end of each month for the work performed during that month. However, for milestone-based projects or projects with fixed monthly rates, the payment schedule may vary.",
          "2.\tHourly Tracking: To track the hours worked by freelancers on your project, you can log into your account and review the hours submitted. This allows you to monitor the progress and ensure transparency in the billing process.",
          "3.\tPayment Due: Payment for the services provided is due upon receipt of the invoice. You will receive the invoice detailing the services rendered and the amount owed.",
          "Please note that specific payment terms and details will be outlined in your contract with EASWORKS. It is important to review the terms and follow the agreed-upon payment schedule to ensure a smooth payment process."
        ]
      },
      {
        "title": "What payment methods are accepted by EASWORKS?",
        "slug": "",
        "content": [
          "EASWORKS accepts ACH, wire transfers, and credit card payments as payment methods.",
          "Please note that specific instructions and details regarding payment methods will be provided to you during the invoicing process or in your contract with EASWORKS."
        ]
      }
    ]
  }
]