[
  {
    "title": "Client Overview",
    "slug": "client-overview",
    "items": [
      {
        "title": "What is EASWORKS?",
        "slug": "what-is-easworks"
      },
      {
        "title": "How does EASWORKS work?",
        "slug": "how-does-easworks-work"
      },
      {
        "title": "How is EASWORKS different from other platforms?",
        "slug": "how-is-easworks-different-from-other-platforms"
      },
      {
        "title": "What is the definition of EAS Talent as referred to companies by EASWORKS?",
        "slug": "what-is-the-definition-of-eas-talent"
      },
      {
        "title": "What types of projects can be undertaken by hiring EASWORKS?",
        "slug": "what-types-of-projects-can-be-undertaken"
      },
      {
        "title": "What is the role of an Enterprise Success Manager (ESM) with companies?",
        "slug": "what-is-the-role-of-an-enterprise-success-manager"
      },
      {
        "title": "Is there a cost associated with being matched with or interviewing candidates on EASWORKS?",
        "slug": "is-there-a-cost-associated-with-matching-on-easworks"
      },
      {
        "title": "What is the typical timeframe for the hiring process at EASWORKS?",
        "slug": "what-is-the-typical-timeframe-for-hiring-on-easworks"
      },
      {
        "title": "Is there a fee to be matched with or interview candidates on EASWORKS?",
        "slug": "is-there-a-fee-to-be-matched-or-interviewed-on-easworks"
      },
      {
        "title": "What engagement options does EASWORKS offer to meet clients enterprise application needs",
        "slug": "what-engagement-options-does-easworks-offer"
      },
      {
        "title": "Is there a minimum contract duration?",
        "slug": "is-there-a-minimum-contract-duration"
      },
      {
        "title": "Is it possible to hire a full-time worker from EASWORKS and integrate them into our company?",
        "slug": "is-it-possible-to-hire-a-full-time-worker-from-easworks"
      },
      {
        "title": "What are the payment terms and conditions on EASWORKS?",
        "slug": "what-are-the-payment-terms-and-conditions"
      },
      {
        "title": "How does the Work Skill Assessment (WSA) performed on talents help clients in their project engagements?",
        "slug": "how-does-the-work-skill-assessment-help-clients"
      }
    ]
  },
  {
    "title": "Getting Started With EASWORKS",
    "slug": "getting-started-with-easworks",
    "items": [
      {
        "title": "How can I get started with EASWORKS as an employer?",
        "slug": "how-can-i-get-started-with-easworks-as-an-employer"
      },
      {
        "title": "How can I initiate a project with EASWORKS?",
        "slug": "how-can-i-initiate-a-project-with-easworks"
      },
      {
        "title": "How can I view candidates after registration?",
        "slug": "how-can-i-view-candidates-after-registration"
      },
      {
        "title": "How can I interact with candidates on EASWORKS?",
        "slug": "how-can-i-interact-with-candidates-on-easworks"
      },
      {
        "title": "How soon can EASWORKS developers become part of my team?",
        "slug": "how-soon-can-easworks-developers-become-part-of-my-team"
      },
      {
        "title": "If there is currently no available talent to meet the requirements of my work request, how long should I anticipate waiting for the right talent?",
        "slug": "if-there-is-currently-no-available-talent-to-meet-the-requirements-of-my-work-request-how-long-should-i-anticipate-waiting-for-the-right-talent"
      }
    ]
  },
  {
    "title": "Testing & Screening",
    "slug": "testing-and-screening",
    "items": [
      {
        "title": "Do the developers at EASWORKS possess fluency in English?",
        "slug": "do-the-developers-at-easworks-possess-fluency-in-english"
      },
      {
        "title": "How does your screening process work?",
        "slug": "how-does-your-screening-process-work"
      },
      {
        "title": "How does your EAS talent vetting process work?",
        "slug": "how-does-your-eas-talent-vetting-process-work"
      }
    ]
  },
  {
    "title": "Working With Global Talent",
    "slug": "working-with-global-talent",
    "items": [
      {
        "title": "What are the various engagement models available for hiring EAS talent?",
        "slug": "what-are-the-various-engagement-models-available-for-hiring-eas-talent"
      },
      {
        "title": "What is the geographical distribution and time zone of EASWORKS developers?",
        "slug": "what-is-the-geographical-distribution-and-time-zone-of-easworks-developers"
      },
      {
        "title": "Where do EASWORKS experts primarily work?",
        "slug": "where-do-easworks-experts-primarily-work"
      },
      {
        "title": "How can I track and monitor the progress of my EAS project?",
        "slug": "how-can-i-track-and-monitor-the-progress-of-my-eas-project"
      },
      {
        "title": "How does EASWORKS facilitate and oversee project collaboration?",
        "slug": "how-does-easworks-facilitate-and-oversee-project-collaboration"
      },
      {
        "title": "Can I make changes to my current engagement with EASWORKS?",
        "slug": "can-i-make-changes-to-my-current-engagement-with-easworks"
      },
      {
        "title": "Is it possible to have EASWORKS experts work on-site as needed?",
        "slug": "is-it-possible-to-have-easworks-experts-work-on-site-as-needed"
      },
      {
        "title": "What if Im not satisfied with the EASWORKS services?",
        "slug": "what-if-im-not-satisfied-with-the-easworks-services"
      },
      {
        "title": "What if my EAS Talent is unavailable during their scheduled workdays or times?",
        "slug": "what-if-my-eas-talent-is-unavailable-during-their-scheduled-workdays-or-times"
      }
    ]
  },
  {
    "title": "Intellectual Property",
    "slug": "",
    "link": "",
    "items": [
      {
        "title": "Who holds the legal rights to the work produced by an EASWORKS talent? ",
        "slug": "",
        "content": [
          "The client retains exclusive ownership of the work created by an EASWORKS talent. ",
          "EASWORKS focus is on connecting clients with exceptional Enterprise Application experts, and our contracts specify that all work produced by the expert is considered \"work for hire\" and belongs to the client, not EASWORKS or the expert."
        ]
      },
      {
        "title": "How can I protect my intellectual property (IP) with EASWORKS? ",
        "slug": "",
        "content": [
          "Safeguarding your intellectual property is a priority for us. EASWORKS is willing to establish a mutual non-disclosure agreement (NDA) to ensure confidentiality before delving into project specifics. ",
          "We have stringent confidentiality agreements with our contractors, and its important to note that IP is never owned by any freelancer who is hired either part time or full time.",
          "Additionally, if desired, you can opt to sign additional agreements such as a Master Services Agreement (MSA) with the developer for added protection."
        ]
      },
      {
        "title": "How does EASWORKS ensure the protection of our intellectual property (IP)? ",
        "slug": "",
        "content": [
          "EASWORKS prioritizes the protection of your intellectual property. Through our contract agreements, we secure exclusive ownership of the work created by the EASWORKS talent assigned to your project. ",
          "This ensures that you have full control and rights over intellectual property. Our client agreement follows the principle of \"work for hire,\" granting you the necessary legal rights.",
          " This approach has been successful in safeguarding our clients IP over the years and has provided them with peace of mind. If you have specific requirements regarding IP ownership, we are open to discussing and accommodating them to meet your needs."
        ]
      }
    ]
  },
  {
    "title": "Pricing And Payments",
    "slug": "",
    "link": "",
    "items": [
      {
        "title": "What are the pricing details for hiring a developer through EASWORKS?",
        "slug": "",
        "content": [
          "At EASWORKS, the cost of hiring a developer varies depending on several factors. While we work with remote developers located worldwide, our common talent pool comes from Latin America, South Asia, and Eastern Europe. This allows us to offer competitive rates while ensuring collaboration in overlapping time zones.",
          "The rates for developers typically range between $40-$110 USD per hour. However, its important to note that these rates can vary based on factors such as enterprise application skills, technologies, experience, and geographic location.",
          "When hiring through EASWORKS, there are no hidden or extra fees. You only pay for the hours worked by the candidates you select, as per the agreed terms and conditions outlined in the contract."
        ]
      },
      {
        "title": "What is the payment process for EASWORKS services?",
        "slug": "",
        "content": [
          "The payment process for EASWORKS services depends on the type of engagement you have with us. Here is an overview:",
          "1.\tBilling Cycle: For most engagements, you will be billed at the end of each month for the work performed during that month. However, for milestone-based projects or projects with fixed monthly rates, the payment schedule may vary.",
          "2.\tHourly Tracking: To track the hours worked by freelancers on your project, you can log into your account and review the hours submitted. This allows you to monitor the progress and ensure transparency in the billing process.",
          "3.\tPayment Due: Payment for the services provided is due upon receipt of the invoice. You will receive the invoice detailing the services rendered and the amount owed.",
          "Please note that specific payment terms and details will be outlined in your contract with EASWORKS. It is important to review the terms and follow the agreed-upon payment schedule to ensure a smooth payment process."
        ]
      },
      {
        "title": "What payment methods are accepted by EASWORKS?",
        "slug": "",
        "content": [
          "EASWORKS accepts ACH, wire transfers, and credit card payments as payment methods.",
          "Please note that specific instructions and details regarding payment methods will be provided to you during the invoicing process or in your contract with EASWORKS."
        ]
      }
    ]
  }
]