{
  "how-can-i-get-started-with-easworks-as-an-employer": {
    "content": [
      "To get started with EASWORKS as an employer, follow these three simple steps:",
      "1.\tStep 1: Visit the EASWORKS website or platform. ",
      "2.\tStep 2: Create an employer account by providing your company information and contact details. ",
      "3.\tStep 3: Explore the available enterprise application services and solutions offered on the platform.",
      "By completing these steps, you can begin your journey with EASWORKS and gain access to a wide range of enterprise application services and solutions for your business needs."
    ]
  },
  "how-can-i-initiate-a-project-with-easworks": {
    "content": [
      "1.\tFill out the Start Hiring Questionnaire, providing all project requirements.",
      "2.\tA Technical expert from EASWORKS will reach out to discuss your needs and ensure a clear understanding.",
      "3.\tEngage in a conversation with our team to align on expectations and benefit from our expertise.",
      "4.\tFinalize your Job Description on our platform to initiate the sourcing and vetting of potential candidates for your project."
    ]
  },
  "how-can-i-view-candidates-after-registration": {
    "content": [
      "•\tTo view candidates after registration, create a job post by filling out the Start Hiring Questionnaire.",
      "•\tSkill-matched members will be alerted and invited to apply, and our technical team will personally reach out to top enterprise application talent who are fit.",
      "•\tCandidate concurrence is obtained before sharing potential candidates with you.",
      "•\tProvide all the necessary information in the questionnaire to expedite the process.",
      "•\tCandidates typically become available for viewing and interviewing within 1-5 business days based on network availability and specific requirements."
    ]
  },
  "how-can-i-interact-with-candidates-on-easworks": {
    "content": [
      "Throughout the candidate selection and interview process on our platform, all communication is facilitated by EASWORKS. This means that contacting candidates through personal email or social media channels is not permitted.",
      "Once you have signed a contract with a selected candidate and work has commenced, you are free to communicate with them outside of the platform."
    ]
  },
  "how-soon-can-easworks-developers-become-part-of-my-team": {
    "content": [
      "1.\tIf a pre-vetted candidate is already available, the timeline for EASWORKS developers joining your team depends on the interview process and your preferred start date.",
      "2.\tIn situations where candidates are not immediately available, we initiate the recruitment process to identify the most suitable candidate for your project.",
      "3.\tRest assured that we will keep you well-informed and involved throughout the onboarding process, ensuring you are updated on the progress and timeline every step of the way."
    ]
  },
  "if-there-is-currently-no-available-talent-to-meet-the-requirements-of-my-work-request-how-long-should-i-anticipate-waiting-for-the-right-talent": {
    "content": [
      "We recognize that finding the ideal enterprise application talent can be challenging due to the specialized nature of these skills. ",
      "However, with our extensive network within the enterprise community and our commitment to quality, we strive to match you with the perfect talent for your project. ",
      "While we understand your immediate needs, our focus is on ensuring the highest quality match. Typically, it takes approximately 8-14 days to find and present the right talent that aligns with your requirements."
    ]
  }
}
