{
  "how-does-easworks-typically-select-freelancers-for-new-enterprise-application-project-opportunities": {
    "content": [
      "Typical Steps Followed by EASWORKS for a new enterprise application project opportunity:",
      "1.\tTalent Matching Process:",
      "•\tThe EASWORKS Enterprise Success Manager (ESM) initiates the Talent Matching process to find the best match between the Customer and Talent.",
      "•\tIf notified as a Talent Match by the ESM, proceed to the next step.",
      "2.\tClient Interview:",
      "•\tDecide whether to accept or pass on the client interview opportunity.",
      "•\tIf selected, a contract will be offered, specifying deliverables, expectations, and payment details.",
      "3.\tAccepting the Contract:",
      "•\tOnce you accept the contract, you can begin working on the Customers project."
    ]
  },
  "what-factors-should-i-consider-when-determining-my-hourly-rate-as-a-new-freelancer-in-the-field-of-enterprise-application-development": {
    "content": [
      "•\tResearch Enterprise Application Freelance Rates for specific enterprise domain.",
      "•\tExplore the rates of IT service companies that offer similar Enterprise Application services.",
      "•\tSeek advice from fellow freelancers or \"coworkers\" in the industry.",
      "•\tTalk to individuals who have previously hired freelancers to gain insights into their pricing expectations.",
      "•\tAnalyze the rates charged by other freelancers in your specific enterprise application domain.",
      "•\tConsider the average range for your enterprise application services based on factors such as your location, experience, and market conditions."
    ]
  },
  "how-does-the-negotiation-and-contract-process-work-on-easworks-for-freelancers": {
    "content": [
      "Negotiations and contracts on EASWORKS follow a streamlined process:",
      "1.\tNegotiations",
      "•\tEASWORKS negotiates the hourly rate on your behalf when a client decides to hire you for enterprise project.",
      "•\tIn most cases, negotiations are not required as clients typically agree to the hourly rate you have specified in your profile.",
      "2.\tContract Execution:",
      "•\tAs an EASWORKS talent, you will enter into a comprehensive contractual agreement with EASWORKS for specific enterprise projects. This agreement governs your activities on the platform in accordance with the project requirements, including a non-disclosure agreement (NDA) clause to protect client information. It clearly defines your job responsibilities, roles, deliverables, mutually agreed-upon hourly rate, contract period, and time zone alignment.",
      "•\tFor each new job opportunity, EASWORKS facilitates the creation of a distinct contract involving the client and EASWORKS. This contract provides a detailed outline of the job responsibilities, roles, deliverables, project budget, contract period, performance assessment metrics, and any additional requirements as necessary.",
      "•\tEASWORKS places a strong emphasis on securing pre-payment whenever feasible, ensuring financial security for both parties involved. Furthermore, EASWORKS supports the establishment of direct introductions between you and the client, facilitating a seamless transition and enabling you to promptly and efficiently commence work.",
      "3.\tLong-Term Enterprise Projects:",
      "•\tFor long-term enterprise projects, EASWORKS offers clients the opportunity to conduct a risk-free trial period to assess the suitability of freelancers. This trial period, which spans from 20 to 40 hours on average, will be communicated to freelancers as part of the project evaluation process.",
      "EASWORKS manages these agreements, ensuring you are informed about the project duration agreed upon with the client."
    ]
  },
  "what-steps-follows-after-signing-of-a-contract-with-an-easworks-client": {
    "content": [
      "Once the contract is signed, the process proceeds as follows:",
      "•\tEASWORKS establishes a collaboration platform, typically using Slack channels, to facilitate smooth engagement.",
      "•\tYou will be included in a channel alongside the client for ongoing communication throughout the enterprise application project.",
      "•\tIn addition, there will be a dedicated channel for communication exclusively between you and the EASWORKS team, ensuring effective coordination.",
      "After establishing direct contact with the client, whether through Slack or email, it is recommended to initiate an introductory call to initiate the project.",
      "To ensure efficient project management, it is advisable to establish a project cadence, including scheduled weekly office hours and check-in times with the client. If you need any assistance during the project kick-off phase, the EASWORKS Enterprise Success Manager (ESM) will serve as your primary point of contact."
    ]
  },
  "what-steps-can-be-taken-to-effectively-log-hours-on-easworks": {
    "content": [
      "To log your hours effectively, we recommend following these steps:",
      "1.\tDaily Activity Log:",
      "•\tUse EASWORKS online timesheet tool to update your activity log on a daily basis.",
      "•\tThis provides the client with insight into the activities performed and the time spent on each activity.",
      "2.\tWeekly Billable Hours Timesheet:",
      "•\tThe activity cum time log serves as the basis for your weekly billable hour’s timesheet.",
      "•\tThis timesheet will require client approval, and it is essential for upcoming payment processing.",
      "Remember, maintaining a detailed timesheet allows you to track how your time is spent, even on seemingly trivial activities."
    ]
  },
  "why-and-when-is-the-trial-period-offered": {
    "content": [
      "The trial period is offered on a case-by-case basis, typically spanning 20-40 hours. It allows clients to try out EASWORKS Talent, especially when they are new to this engagement model or unsure about the success rate. ",
      "This trial phase holds significant importance as it provides an opportunity for you to showcase your skills and capabilities. ",
      "Following the trial period, the aim is to secure recurring subscriptions from clients, enabling you to plan your work several months in advance."
    ]
  }
}
