[{
        "title": "Vetted Individuals",
        "desc": "Bridge the EAS Skill Gap in Your Team with our pre-vetted EAS professionals who bring the enterprise application expertise and the skill set you're looking for.",
        "img": "https://assets3.lottiefiles.com/packages/lf20_7akav0kg.json",
        "content": {
            "title": "Vetted Individuals",
            "sec_1_title": "Hire Individual top EAS Talents on-demand based on skill or role.",
            "sec_1_desc": "<p>With the right EAS team members, you can boost the EAS project's performance, outcome, and smoothness to any enterprise projects and, as they enter new phases of maturity, sometimes it’s necessary to add new EAS members or fill the skill gaps who are just right for the job. </p> <p>EAS talent can be hire skilled professionals for short term or long-term project based on your EAS projects goal.</p><p>EASWORKS allows you to hire EAS  talent on-demand (Talent as a service - TaaS), proven, reliable, and cost-effective way for our enterprise clients.</p>",
            "sec_1_btn_txt": "Talk to us",
            "sec_2": [{
                    "img": "https://assets10.lottiefiles.com/packages/lf20_0eaxhxe9.json",
                    "title": "Dedicated EAS individuals",
                    "desc": "Assigned to a particular client and will remain intact over the life cycle of EAS project."
                },
                {
                    "img": "https://assets8.lottiefiles.com/packages/lf20_2vbrgwmu.json",
                    "title": "Top EAS Experts",
                    "desc": "Integrate EAS experts with domain-centric professionals to add value to their projects."
                },
                {
                    "img": "https://assets4.lottiefiles.com/packages/lf20_0ky62hmv.json",
                    "title": "Cost-effectiveness",
                    "desc": "Hire EAS talents at a minimal cost for any EAS specialized skills which otherwise with tradition recruitment process takes time and resources to recruit."
                },
                {
                    "img": "https://assets9.lottiefiles.com/packages/lf20_eazzq9gt.json",
                    "title": "Save Time",
                    "desc": "Ready to hire pre-vetted right EAS professionals for every role in less time."
                },
                {
                    "img": "https://assets5.lottiefiles.com/packages/lf20_lcbapqtv.json",
                    "title": "Maintain oversight & control",
                    "desc": "Integrate into your internal team’s processes, daily/weekly report and participate actively in daily meetings and progress reports."
                }
            ],
            "sec_3_img": "https://assets4.lottiefiles.com/packages/lf20_ureyqxyw.json",
            "sec_3_steps": [{
                    "step": "01",
                    "title": "Talent & Higher EAS Experts Commitment",
                    "desc": "Quickly integrate outstanding software engineers that increase your team's capacity and add value to your project."
                },
                {
                    "step": "02",
                    "title": "Easy Hiring & scalability",
                    "desc": "Easily find and hire the specific EAS skill sets needed for each of your projects. No need to worry about talent retention & other regular employee trainings."
                },
                {
                    "step": "03",
                    "title": "Faster Productivity",
                    "desc": "Smooth out any project road bumps and minimize downtime with the EAS expertise of an extended team."
                },
                {
                    "step": "04",
                    "title": "Flexibility & predictable monthly cost",
                    "desc": "Increase or decrease the size of your development workforce as needed with on-demand talent to complete the project within the budget."
                }
            ],
            "sec_4_qa": [{
                    "question": "Need specific EAS skills",
                    "ans": "Need to quickly expand your team by bringing in high skilled & domain specific EAS experts."
                },
                {
                    "question": "Need reinforce your In-house EAS team",
                    "ans": "While you have In-house Enterprise Application software developers. For some new projects you will need current expertise. In this case, strengthen your IT team."
                },
                {
                    "question": "Short on deadline",
                    "ans": "The recruitment process takes a lot of time from job advertisement, interviewing to onboarding. Thoroughly vetted EAS talent provides the quick way to hiring extra developers."
                },
                {
                    "question": "As a bridge for hire",
                    "ans": "Short-term employment may turn into longer employee relations."
                }
            ],
            "sec_4_img": "https://assets7.lottiefiles.com/packages/lf20_moral0w2.json",
            "sec_5_title": [{
                    "title": "Identifying talent gaps",
                    "desc": "Based on your project and analyze if your in-house team has the needed skills and time to fulfill the project themselves across the project lifecycle. Make a list of what Enterprise Application resources and technologies are required to complete the project smoothly.</p> <p>If you see a talent shortage on your team to handle the EAS project, then get in touch with EASWORKS to fill the gaps.",
                    "img": "https://assets8.lottiefiles.com/packages/lf20_dczitgbo.json"
                },
                {
                    "title": "Interview talent matches",
                    "desc": "Interview hand selected and pre-screened EAS talent matches based on your project requirement,skills,industry experience.",
                    "img": "https://assets4.lottiefiles.com/packages/lf20_a4ylhiy1.json"
                },
                {
                    "title": "Onboarding and work integration",
                    "desc": "Work with EASWORKS team to  settling the terms and conditions, signing contracts and NDAs. Introduce the new EAS team members into your company, inform them of technical concepts, and design a work plan cadence.",
                    "img": "https://assets8.lottiefiles.com/packages/lf20_5ae3glqy.json"
                },
                {
                    "title": "Managing the process",
                    "desc": "The last step involves managing the EAS project with your vetted individuals EASWORK talent while learning and relearning various aspects. Make sure the roles are apparent and the objectives/goals clearly defined including the needed daily/weekly/monthly reports.",
                    "img": "https://assets10.lottiefiles.com/packages/lf20_lu4mttg4.json"
                }
            ],
            "sec_6_title": "EASWORKS connects the elite Enterprise Application software Individual talents all over the world"
        }
    },
    {
        "title": "Full Teams",
        "desc": "Hire a fully equipped remote team on a per-project basis with needed EAS skills, ready to start immediately.",
        "img": "https://assets2.lottiefiles.com/packages/lf20_kcovw7lp.json",
        "content": {
            "title": "Full Team",
            "sec_1_title": "Hire EAS dedicated full team to deliver tech solutions and the value.",
            "sec_1_desc": "<p>EASWORKS provides all the EAS roles needed to complete the team you require. This is typically composed of a Sr.Developer, Solution Architect, UX/UI Designer, QA engineers, PM and other roles that are defined for each specific Enterprise Application project. Management is conducted jointly by a Scrum Master and the client’s product owner.  </p> <p>With Dedicated Full Team approach of having experienced EAS professionals, EASWORKS can immediately deliver technology solutions with quickly assembled teams ready to work & support on your EAS project and project responsibility and ownership are shared by the client and the EASWORKS determining on which responsibilities belong to whom.</p><p>Typical  EASWORKS Full team consists of all the key needed stakeholders based on your specific EAS project :</p> <ul><li>Sr. Developers</li><li>QA engineers</li><li>DevOps engineers</li><li>Project managers</li><li>UX/UI designers</li><li>Solution Architect</li><li>Business analysts</li></ul>",
            "sec_1_btn_txt": "Talk to us",
            "sec_2": [{
                    "img": "https://assets8.lottiefiles.com/packages/lf20_i0gwtggi.json",
                    "title": "Full Equipped EAS Team",
                    "desc": "Assigned to a particular client and will remain intact over the life cycle of EAS project delivery."
                },
                {
                    "img": "https://assets1.lottiefiles.com/packages/lf20_1akvcxjr.json",
                    "title": "Top full team experts",
                    "desc": "Quickly build a highly qualified, creative, and experienced team with professionals & needed EAS skills to attain your business goals."
                },
                {
                    "img": "https://assets6.lottiefiles.com/packages/lf20_qloh0efc.json",
                    "title": "Cost-effectiveness",
                    "desc": "Hire fully equipped EAS team at a minimal cost for any EAS specialized skills which otherwise with tradition recruitment process takes time and resources to recruit."
                },
                {
                    "img": "https://assets4.lottiefiles.com/packages/lf20_94syemht.json",
                    "title": "Save Time",
                    "desc": "Ready to hire pre-vetted  full team of EAS professionals in less time."
                }
            ],
            "sec_3_img": "https://assets5.lottiefiles.com/packages/lf20_ifcsdsaa.json",
            "sec_3_steps": [{
                    "step": "01",
                    "title": "Full team with Trained and Experienced Professionals ",
                    "desc": "If you lack the skills or experience needed to manage EAS projects on your own. EASWORKS talents consists of well-trained, experienced, qualified, and certified professionals who can manage your EAS project efficiently and cost-effectively."
                },
                {
                    "step": "02",
                    "title": "Control IT Costs",
                    "desc": "Ensures predictable IT expenditure without any additional costs and with a fairly low initial investment on specialized EAS skills."
                },
                {
                    "step": "03",
                    "title": "Implement New Technology Quickly",
                    "desc": "Implementing new technology requires hiring the right people, training them, and then giving them the support/resources, they need. This is time-consuming and EASWORKS can help you implement new technology quickly, saving you both time and money."
                },
                {
                    "step": "04",
                    "title": "Stay Focused on Your Core Business",
                    "desc": "The ability to stay focused on your core business is probably the biggest benefit of having EASWORKS full equipped team which eliminates the distraction of complex IT decisions, allowing you to focus on what you do best."
                }
            ],
            "sec_4_qa": [{
                    "question": "Hiring in house team -unjustified",
                    "ans": "Long-term projects on broadscale and unpredictable changes and lags in-house house Enterprise Application software developers. When dealing with a one-time tech EAS project, hiring an in-house team is not justified."
                },
                {
                    "question": "EAS project -priority & criticality",
                    "ans": "While you have in-house Enterprise Application team is already working on other EAS development projects and can't focus on one more project and based on various other factors like business impact, timeline and long-term business goals."
                },
                {
                    "question": "Need specific EAS skills ",
                    "ans": "Quickly build a highly experienced full  team with professionals with needed EAS skills which lags within your in-house team to attain your business goals. <br> You need to quickly expand your team by bringing in high skilled & domain specific EAS experts."
                },
                {
                    "question": "Lean In-house Development team",
                    "ans": "When you still want to be a decision-maker and to continue development of your EAS project  quickly, but most activities can be done without you."
                }
            ],
            "sec_4_img": "https://assets6.lottiefiles.com/packages/lf20_vneroaor.json",
            "sec_5_title": [{
                    "title": "Core business & Identifying talent gaps within team. ",
                    "desc": "<p>Based on your project and analyze if  this is core to your business and check your in-house team has the needed skills and time to fulfill the project themselves. Make a list of what Enterprise Application resources and technologies are required to complete the project smoothly.</p> <p>If you see a that this is not core to your business or have talent shortage on different technologies & skills needed for the EAS project, then get in touch with EASWORKS to fill the gaps.</p>",
                    "img": "https://assets10.lottiefiles.com/packages/lf20_zpt5gciw.json"
                },
                {
                    "title": "Assemble Fully – equipped EAS team",
                    "desc": "Assemble a fully equipped EAS team based on your specific project requirement, who are ready to follow your lead.",
                    "img": "https://assets4.lottiefiles.com/packages/lf20_i96jxrhn.json"
                },
                {
                    "title": "Onboarding and work integration",
                    "desc": "Work with EASWORKS team to  settling the terms and conditions, signing contracts and NDAs. Introduce the  Full team to the clients product owner, inform them of technical concepts, and design a work plan cadence to work & lead this team.",
                    "img": "https://assets10.lottiefiles.com/packages/lf20_uhbelogd.json"
                },
                {
                    "title": "Managing the deliverables",
                    "desc": "The last step involves managing the EAS project with EASWORKS full team talents. Make sure the roles are apparent and the objectives/goals clearly defined including the needed  progress reports and milestone-based deliverables.",
                    "img": "https://assets4.lottiefiles.com/packages/lf20_fcw4d5mv.json"
                }
            ],
            "sec_6_title": "EASWORKS connects the elite Enterprise Application software Individual talents all over the world"
        }
    },
    {
        "title": "Enterprise Application Projects",
        "desc": "EASWORKS platform allows us to pull from the elite global enterprise application talent to create a hand-picked AND fully managed team to reliably deliver on your enterprise project within your budget and deadlines.",
        "img": "https://assets6.lottiefiles.com/packages/lf20_agykieqg.json",
        "content": {
            "title": "Enterprise Application Projects",
            "sec_1_title": "Partner with EASWORKS to deliver any complex EAS projects using latest tech stack.",
            "sec_1_desc": "<p>EASWORKS manages the whole process of  enterprise application development , testing & implementation based on your specifications, schedule & budget. </p> <p>Partnering & outsourcing with EASWORKS allows organizations to develop high-quality software products in a cost-efficient way. From smart customization of pre-developed platforms to full-cycle custom reliable solutions.</p><p>EASWORKS will develop the enterprise Application operating using agile best practices & methodologies.  In-house Project Manager/Product Owner will have weekly/monthly/milestones-based cadence with EASWORKS based on mutual agreement during the project planning phase based on EAS project complexity.</p>",
            "sec_1_btn_txt": "Talk to us",
            "sec_2": [{
                    "img": "https://assets10.lottiefiles.com/packages/lf20_nnnq5pbo.json",
                    "title": "EAS Project ownership",
                    "desc": "Entire EAS Project life cycle owned and managed by Partners and no recruitment risk."
                },
                {
                    "img": "https://assets6.lottiefiles.com/packages/lf20_fcw4d5mv.json",
                    "title": "Responsibility for Execution & Deliverables ",
                    "desc": "Based on EAS project complexity, Quickly build a highly qualified, creative, and experienced team with professionals to deliver the project on schedule, quality & cost."
                },
                {
                    "img": "https://assets5.lottiefiles.com/packages/lf20_zcjttp7i.json",
                    "title": "Cost-effectiveness",
                    "desc": "Partnering & outsourcing the EAS projects at a minimal cost for highly EAS specialized EAS skills with different roles."
                },
                {
                    "img": "https://assets5.lottiefiles.com/packages/lf20_7xcnpvhb.json",
                    "title": "Save Time for client",
                    "desc": "Avoid reinventing the wheel when you already have Expertise EAS partner to deliver on your project with needed tech stack in less time."
                }
            ],
            "sec_3_img": "https://assets4.lottiefiles.com/packages/lf20_ureyqxyw.json",
            "sec_3_steps": [{
                    "step": "01",
                    "title": "Clear timeline and outcomes",
                    "desc": "Before you start project-based outsourcing engagement, be clear about defining timelines and deliverables."
                },
                {
                    "step": "02",
                    "title": "Minimal time commitment",
                    "desc": "The least control over the development process  & minimal time commitment for you and your in-house team, it can be a significant advantage for some companies where you still get to focus on  mission-critical projects."
                },
                {
                    "step": "03",
                    "title": "Responsibility for project success lies outside your company.",
                    "desc": "Although you are responsible for documenting the initial requirements and specifications. Your EAS Project-based partner is in charge of execution and delivery & your contract and/or SOWs hold them to their obligations."
                },
                {
                    "step": "04",
                    "title": "Full team with Trained and Experienced Professionals",
                    "desc": "If you lack the skills or experience needed to manage EAS projects on your own. EASWORKS talents with  experienced, qualified, and certified professionals can develop and deliver your EAS project efficiently and cost-effectively on needed tech stack."
                },
                {
                    "step": "05",
                    "title": "Stay Focused on Your Core Business",
                    "desc": "The ability to stay focused on your core business is probably the biggest benefit of partnering with EASWORKS which eliminates the distraction of developing complex EAS project & managing resources, allowing you to focus on what you do best."
                }
            ],
            "sec_4_qa": [{
                    "question": "When you have a EAS project that is not your main product",
                    "ans": "EAS Project-based outsourcing is fit for businesses of all sizes, although it works best for initiatives that are not core products."
                },
                {
                    "question": "When you have limited in-house development capabilities",
                    "ans": "EASWORKS owns the responsibility and process, a project-based approach is suitable for firms with limited engineering/IT expertise. Businesses of all sizes may create unique software products by outsourcing development to an expert EASWORKS."
                },
                {
                    "question": "Simple projects have pre-determined needs that are unlikely to change.",
                    "ans": "EASWORKS with project-based outsourcing engagement model can complete these tasks without your input."
                },
                {
                    "question": "When you need a EAS project delivered quickly and efficiently - without the burden of management",
                    "ans": "Again, project-based outsourcing works best for customers that know exactly what they want. You may successfully hand off your EAS project and relieve yourself of the strain of management."
                }
            ],
            "sec_4_img": "https://assets6.lottiefiles.com/packages/lf20_vneroaor.json",
            "sec_5_title": [{
                    "title": "Core business & Identifying Outsourcing partner",
                    "desc": "Based on your project and analyze if  this is core to your business and check your in-house team has the needed skills and time to fulfill the project themselves. Make a list of what Enterprise Application resources and technologies are required to complete the project smoothly.</p> <p>If you see a that this is not core to your business or have talent shortage on different technologies & skills needed for the EAS project, then get in touch with EASWORKS to partner & outsource your Application project.",
                    "img": "https://assets5.lottiefiles.com/packages/lf20_ilwog45y.json"
                },
                {
                    "title": "Provide Enterprise Application specification, budget & time",
                    "desc": "EAS Project-based outsourcing is when your development partner EASWORKS oversees and manages the whole process based on your specifications.",
                    "img": "https://assets4.lottiefiles.com/packages/lf20_l50kadvu.json"
                },
                {
                    "title": "Onboarding and work integration",
                    "desc": "Work with EASWORKS team to  settling the terms and conditions for EAS projects outsourcing, signing contracts and NDAs. Introduce the  development partner -EASWORKS to the clients product owner and design a work plan cadence to execute the project deliverables.",
                    "img": "https://assets8.lottiefiles.com/packages/lf20_aqqx1iue.json"
                },
                {
                    "title": "Project release & Acceptance criteria definition",
                    "desc": "The last step involves managing the EAS project with EASWORKS development partner. Make sure the roles are apparent and the objectives/goals clearly defined including the schedule, project release & acceptance criteria, cost and milestone-based deliverables.",
                    "img": "https://assets10.lottiefiles.com/packages/lf20_fguyxmbf.json"
                }
            ],
            "sec_6_title": "EASWORKS delivers & supports Enterprise Application software according to your specifications."
        }
    }
]